#+NAME: sus-vp2
| Frage | Wertung | SUS |
|-------+---------+-----|
|     1 |       5 |   4 |
|     2 |       1 |   4 |
|     3 |       5 |   4 |
|     4 |       1 |   4 |
|     5 |       5 |   4 |
|     6 |       1 |   4 |
|     7 |       2 |   1 |
|     8 |       1 |   4 |
|     9 |       5 |   4 |
|    10 |       2 |   3 |
#+TBLFM: @12$3=vsum(@2$3..@11$3);N::@13$3=@12$3*2.5::$3='(if (oddp $1) (- $2 1) (- 5 $2));N


#+NAME: sus-vp3
| Frage | Wertung | SUS |
|-------+---------+-----|
|     1 |       5 |   4 |
|     2 |       1 |   4 |
|     3 |       5 |   4 |
|     4 |       1 |   4 |
|     5 |       5 |   4 |
|     6 |       1 |   4 |
|     7 |       5 |   4 |
|     8 |       1 |   4 |
|     9 |       4 |   3 |
|    10 |       4 |   1 |
#+TBLFM: @12$3='(+ @2$3..@11$3);N::@13$3='(* 2.5 @12$3);N::$3='(if (oddp $1) (- $2 1) (- 5 $2));N

#+NAME: sus-vp4
| Frage | Wertung | SUS |
|-------+---------+-----|
|     1 |       5 |   4 |
|     2 |       1 |   4 |
|     3 |       4 |   3 |
|     4 |       1 |   4 |
|     5 |       5 |   4 |
|     6 |       2 |   3 |
|     7 |       5 |   4 |
|     8 |       1 |   4 |
|     9 |       4 |   3 |
|    10 |       2 |   3 |
#+TBLFM: @12$3=vsum(@2$3..@11$3);N::@13$3=@12$3*2.5::$3='(if (oddp $1) (- $2 1) (- 5 $2));N

#+NAME: sus-vp5
| Frage | Wertung | SUS |
|-------+---------+-----|
|     1 |       4 |   3 |
|     2 |       1 |   4 |
|     3 |       4 |   3 |
|     4 |       2 |   3 |
|     5 |       4 |   3 |
|     6 |       1 |   4 |
|     7 |       5 |   4 |
|     8 |       1 |   4 |
|     9 |       4 |   3 |
|    10 |       3 |   2 |
#+TBLFM: $3='(if (oddp $1) (- $2 1) (- 5 $2));N

#+NAME: sus-vp6
| Frage | Wertung | SUS |
|-------+---------+-----|
|     1 |       4 |   3 |
|     2 |       1 |   4 |
|     3 |       4 |   3 |
|     4 |       2 |   3 |
|     5 |       4 |   3 |
|     6 |       1 |   4 |
|     7 |       5 |   4 |
|     8 |       1 |   4 |
|     9 |       4 |   3 |
|    10 |       3 |   2 |
#+TBLFM: @12$3=vsum(@2$3..@11$3);N::@13$3=@12$3*2.5::$3='(if (oddp $1) (- $2 1) (- 5 $2));N


#+NAME:sus-vp7
| Frage | Wertung | SUS |
|-------+---------+-----|
|     1 |       5 |   4 |
|     2 |       2 |   3 |
|     3 |       5 |   4 |
|     4 |       1 |   4 |
|     5 |       5 |   4 |
|     6 |       2 |   3 |
|     7 |       5 |   4 |
|     8 |       1 |   4 |
|     9 |       4 |   3 |
|    10 |       1 |   4 |
#+TBLFM: @12$3=vsum(@2$3..@11$3);N::@13$3=@12$3*2.5::$3='(if (oddp $1) (- $2 1) (- 5 $2));N


#+NAME: sus-vp8
| Frage | Wertung | SUS |
|-------+---------+-----|
|     1 |       5 |   4 |
|     2 |       1 |   4 |
|     3 |       4 |   3 |
|     4 |       2 |   3 |
|     5 |       4 |   3 |
|     6 |       1 |   4 |
|     7 |       4 |   3 |
|     8 |       1 |   4 |
|     9 |       4 |   3 |
|    10 |       1 |   4 |
#+TBLFM: @12$3=vsum(@2$3..@11$3);N::@13$3=@12$3*2.5::$3='(if (oddp $1) (- $2 1) (- 5 $2));N

#+NAME: sus-vp9
| Frage | Wertung | SUS |
|-------+---------+-----|
|     1 |       5 |   4 |
|     2 |       1 |   4 |
|     3 |       5 |   4 |
|     4 |       2 |   3 |
|     5 |       5 |   4 |
|     6 |       1 |   4 |
|     7 |       5 |   4 |
|     8 |       1 |   4 |
|     9 |       4 |   3 |
|    10 |       1 |   4 |

#+TBLFM: @12$3=vsum(@2$3..@11$3);N::@13$3=@12$3*2.5::$3='(if (oddp $1) (- $2 1) (- 5 $2));N

#+BEGIN_SRC R :var vp2=sus-vp2 vp3=sus-vp3 vp4=sus-vp4 vp5=sus-vp5 vp6=sus-vp6 vp7=sus-vp7 vp8=sus-vp8 vp9=sus-vp9 :results output
out <- vector(length=8)
for (i in 2:9) {
# Iterate over participants
vp <- get(paste("vp", i,sep=""))
out[i-1] <- sum(vp$SUS) * 2.5
}
min(out)
max(out)
head(mean(out))
head(sd(out))
t.test(out)
sd(out)
out
#+END_SRC

#+RESULTS:
#+begin_example
[1] 82.5
[1] 95
[1] 88.75
[1] 4.432026

	One Sample t-test

data:  out
t = 56.6384, df = 7, p-value = 1.403e-10
alternative hypothesis: true mean is not equal to 0
95 percent confidence interval:
 85.04473 92.45527
sample estimates:
mean of x 
    88.75 

[1] 4.432026
[1] 90.0 90.0 90.0 82.5 82.5 92.5 87.5 95.0
#+end_example

